# NumberSystem Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberSystem Class
Members See Also
---
An annotation that consists of a series of numeric tags attached to and describing a host element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class NumberSystem : Element
```

Visual Basic
---
```text
Public Class NumberSystem _
	Inherits Element
```

Visual C++
---
```text
public ref class NumberSystem : public Element
```

# Remarks
For a component-based stair, you can display tread/riser numbers for a run in plan, elevation, or section view. Sketch-based stair is not supported.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..NumberSystem
# See Also
NumberSystem Members
Autodesk.Revit.DB Namespace